window.onload = function onLoad(){
  var character_1 = ["怒れる若者", "アンチ・ヒーロー", "観客", "ほら吹き", "男役", "さくら", "腹心", "批評家", "女役", "ヒーロー/ヒロイン", "王", "無礼講の王", "恋人", "吟遊詩人", "老人役/老女役", "劇作家", "犠牲", "悪党", "料理人", "賢者", "敵役", "医者", "道化"];
  var character_1_random = Math.floor(Math.random() * character_1.length);
    target_character_1 = document.getElementById("character_1_id");
    target_character_1.innerHTML = character_1[character_1_random];

  var character_1_location = ["アーチェリー場", "赤ん坊の部屋", "遺跡", "田舎道", "居間", "埋め立てゴミ処理場", "裏庭", "男の隠れ家", "温室", "核シェルター", "火災現場", "果樹園", "家畜小屋", "家庭菜園", "ガレージ", "キャンピングカー", "キャンプ場", "教会", "結婚披露宴", "豪邸", "工房", "子ども部屋", "災害用地下シェルター", "採石場", "サマーキャンプ", "児童擁護施設", "狩猟小屋", "台所", "誕生日パーティー", "地域のパーティー", "地下室", "地下貯蔵室", "通夜", "ツリーハウス", "庭園", "テラス", "灯台", "屠畜場", "鶏小屋", "トレーラーハウス用居住地", "農業祭", "農産物直売会", "農場", "廃鉱", "廃車部品販売所", "剥製工房", "ハロウィンパーティー", "ビーチパーティー", "秘密の通路", "ホームパーティー", "牧場", "牧草地", "墓地", "物置き小屋", "野外トイレ", "屋根裏部屋", "浴室", "霊廟", "ロデオ", "ワイナリー", "ワインセラー", "10代の息子・娘の部屋", "更衣室（学校）", "高校の食堂", "高校の廊下", "校長室", "子どもの遊び場（学校）", "小学校の教室", "職員室", "スクールバス", "体育館", "大学のキャンパス", "大学の講堂", "プロム", "保育園・幼稚園", "用務員室", "理科実験室", "寮の部屋", "荒れ地", "池", "海", "小川", "温泉", "海食洞", "河", "峡谷", "砂漠", "湿原", "草原", "滝", "低湿地", "洞窟", "沼地", "熱帯雨林", "ハイキングコース", "ビーチ", "北極のツンドラ", "湖", "南の島", "森", "山", "アートギャラリー", "空き地", "アトリエ", "ウォーターパーク", "映画館", "エレベーター", "屋外スケートリンク", "屋外プール", "屋内射撃場", "オフィスの個人スペース", "楽屋", "カジノ", "ガソリンスタンド", "鑑別所", "救急救命室", "居住禁止のアパート", "銀行", "軍事基地", "警察署", "競馬場", "刑務所の独房", "劇場", "下水道", "建設現場", "コインランドリー", "公園", "公衆トイレ", "工場", "交通事故現場", "荒廃したアパート", "コミュニティセンター", "ゴルフ場", "サーカス", "死体安置所", "自動車修理工場", "消防署", "心理セラピストのオフィス", "スキーリゾート", "スケートボードパーク", "スパ", "スポーツイベントの観客席", "精神科病棟", "正装行事", "洗車場", "葬儀場", "タトゥースタジオ", "ダンスホール", "小さな町の大通り", "地下道", "駐車場", "動物園", "動物病院", "図書館", "ナイトクラブ", "難民キャンプ", "ニュースルーム", "博物館", "パレード", "繁華街", "美容院", "病室", "ビリヤード場", "フィットネスセンター", "ペントハウス", "法廷", "ボウリング場", "ホームレスシェルター", "ホテルの部屋", "待合室", "モーテル", "役員室", "遊園地", "遊園地のびっくりハウス", "ラスベガスショー", "立体駐車場", "レクリエーションセンター", "レコーディングスタジオ", "老人ホーム", "路地", "ロックコンサート", "アイスクリームショップ", "カジュアルレストラン", "カフェ", "ダイナー", "デリ", "バー", "パブ", "ファストフード店", "ベーカリー", "市場", "占い店", "骨董品店", "コンビニエンスストア", "酒屋", "質屋", "食料雑貨店", "ショッピングモール", "書店", "中古車販売店", "花屋", "ペットショップ", "宝石店", "ホームセンター", "リサイクルショップ", "駅", "救急車", "漁船", "空港", "クルーズ船", "軍用ヘリコプター", "サービスエリア", "市バス", "戦車", "潜水艦", "タクシー", "地下鉄", "地下鉄トンネル", "パトカー", "飛行機", "古い小型トラック", "マリーナ", "ヨット", "リムジン"];
  var character_1_location_random = Math.floor(Math.random() * character_1_location.length);
  console.log(character_1_location[character_1_location_random]);
  target_character_1_location = document.getElementById("character_1_location_id");
  target_character_1_location.innerHTML = character_1_location[character_1_location_random];

  var character_2 = ["怒れる若者", "アンチ・ヒーロー", "観客", "ほら吹き", "男役", "さくら", "腹心", "批評家", "女役", "ヒーロー/ヒロイン", "王", "無礼講の王", "恋人", "吟遊詩人", "老人役/老女役", "劇作家", "犠牲", "悪党", "料理人", "賢者", "敵役", "医者", "道化"];
  var character_2_random = Math.floor(Math.random() * character_2.length);
    console.log(character_2[character_2_random]);
    target_character_2 = document.getElementById("character_2_id");
    target_character_2.innerHTML = character_2[character_2_random];

  var character_2_location = ["アーチェリー場", "赤ん坊の部屋", "遺跡", "田舎道", "居間", "埋め立てゴミ処理場", "裏庭", "男の隠れ家", "温室", "核シェルター", "火災現場", "果樹園", "家畜小屋", "家庭菜園", "ガレージ", "キャンピングカー", "キャンプ場", "教会", "結婚披露宴", "豪邸", "工房", "子ども部屋", "災害用地下シェルター", "採石場", "サマーキャンプ", "児童擁護施設", "狩猟小屋", "台所", "誕生日パーティー", "地域のパーティー", "地下室", "地下貯蔵室", "通夜", "ツリーハウス", "庭園", "テラス", "灯台", "屠畜場", "鶏小屋", "トレーラーハウス用居住地", "農業祭", "農産物直売会", "農場", "廃鉱", "廃車部品販売所", "剥製工房", "ハロウィンパーティー", "ビーチパーティー", "秘密の通路", "ホームパーティー", "牧場", "牧草地", "墓地", "物置き小屋", "野外トイレ", "屋根裏部屋", "浴室", "霊廟", "ロデオ", "ワイナリー", "ワインセラー", "10代の息子・娘の部屋", "更衣室（学校）", "高校の食堂", "高校の廊下", "校長室", "子どもの遊び場（学校）", "小学校の教室", "職員室", "スクールバス", "体育館", "大学のキャンパス", "大学の講堂", "プロム", "保育園・幼稚園", "用務員室", "理科実験室", "寮の部屋", "荒れ地", "池", "海", "小川", "温泉", "海食洞", "河", "峡谷", "砂漠", "湿原", "草原", "滝", "低湿地", "洞窟", "沼地", "熱帯雨林", "ハイキングコース", "ビーチ", "北極のツンドラ", "湖", "南の島", "森", "山", "アートギャラリー", "空き地", "アトリエ", "ウォーターパーク", "映画館", "エレベーター", "屋外スケートリンク", "屋外プール", "屋内射撃場", "オフィスの個人スペース", "楽屋", "カジノ", "ガソリンスタンド", "鑑別所", "救急救命室", "居住禁止のアパート", "銀行", "軍事基地", "警察署", "競馬場", "刑務所の独房", "劇場", "下水道", "建設現場", "コインランドリー", "公園", "公衆トイレ", "工場", "交通事故現場", "荒廃したアパート", "コミュニティセンター", "ゴルフ場", "サーカス", "死体安置所", "自動車修理工場", "消防署", "心理セラピストのオフィス", "スキーリゾート", "スケートボードパーク", "スパ", "スポーツイベントの観客席", "精神科病棟", "正装行事", "洗車場", "葬儀場", "タトゥースタジオ", "ダンスホール", "小さな町の大通り", "地下道", "駐車場", "動物園", "動物病院", "図書館", "ナイトクラブ", "難民キャンプ", "ニュースルーム", "博物館", "パレード", "繁華街", "美容院", "病室", "ビリヤード場", "フィットネスセンター", "ペントハウス", "法廷", "ボウリング場", "ホームレスシェルター", "ホテルの部屋", "待合室", "モーテル", "役員室", "遊園地", "遊園地のびっくりハウス", "ラスベガスショー", "立体駐車場", "レクリエーションセンター", "レコーディングスタジオ", "老人ホーム", "路地", "ロックコンサート", "アイスクリームショップ", "カジュアルレストラン", "カフェ", "ダイナー", "デリ", "バー", "パブ", "ファストフード店", "ベーカリー", "市場", "占い店", "骨董品店", "コンビニエンスストア", "酒屋", "質屋", "食料雑貨店", "ショッピングモール", "書店", "中古車販売店", "花屋", "ペットショップ", "宝石店", "ホームセンター", "リサイクルショップ", "駅", "救急車", "漁船", "空港", "クルーズ船", "軍用ヘリコプター", "サービスエリア", "市バス", "戦車", "潜水艦", "タクシー", "地下鉄", "地下鉄トンネル", "パトカー", "飛行機", "古い小型トラック", "マリーナ", "ヨット", "リムジン"];
  var character_2_location_random = Math.floor(Math.random() * character_2_location.length);
    console.log(character_2_location[character_2_location_random]);
    target_character_2_location = document.getElementById("character_2_location_id");
    target_character_2_location.innerHTML = character_2_location[character_2_location_random];

  var time = ["冬至", "大雪", "小雪", "立冬", "霜降", "寒露", "秋分", "白露", "処暑", "立秋", "大暑", "小暑", "夏至", "芒種", "小満", "立夏", "穀雨", "清明", "春分", "啓蟄", "雨水", "立春", "大寒", "小寒"];
  var time_random = Math.floor(Math.random() * time.length);
    console.log(time[time_random]);
    target_time = document.getElementById("time_id");
    target_time.innerHTML = time[time_random];

}
